<?php
/**
 * 开发记录
 * @author yupoxiong<i@yufuping.com>
 * 2017年8月24日 14:15:58修复修改管理员角色状态导致属于管理员的用户左侧无法显示菜单
 * 2017年8月24日 15:07:20规范验证类，统一设置验证类目录为application/common/validate
 * 2017年8月25日 10:43:27修复文件管理控制器，安装fileinfo扩展,删除采用destroy方法，增加批量删除功能，修改文件表主键file_id=>id
 * 2017年8月25日 16:28:18修复修改菜单是如果选择父级为自己导致菜单不显示的情况
 * 2017年9月8日 15:40:22修复文件管理上传中bug，增加显示文件上传者功能
 * 2017年9月8日 15:40:48添加数据表管理模块
 * 2017年9月8日 15:41:07添加QQ登录功能
 * 2017年9月8日 15:41:20修复数据库备份null字段导出错误问题
 * 2017年9月8日 15:42:00优化数据库备份模块
 * 2017年9月21日 00:22:35添加前台首页
 * 2017年9月21日 00:22:48添加后台登录极验验证功能
 * 2017年9月21日 00:24:29添加404页面
 * 2017年9月21日 00:33:24修复excel示例页面无法导出问题，修复该页面没选择文件直接点导入报错问题
 * 
 * 
 * 
 * 
 * 
 * 
 * 
 * 
 * 
 */